## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.sentinel_service will be updated in-place
  ~ resource "aws_ecs_service" "sentinel_service" {
        id                                 = "arn:aws:ecs:eu-west-1:608859220822:service/sentinel-cluster/sentinel-service"
        name                               = "sentinel-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:608859220822:task-definition/sentinel-task:25" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.sentinel_task must be replaced
-/+ resource "aws_ecs_task_definition" "sentinel_task" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:608859220822:task-definition/sentinel-task:25" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:608859220822:task-definition/sentinel-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  - mountPoints      = [
                      - {
                          - containerPath = "/app/data"
                          - sourceVolume  = "sentinel-efs"
                        },
                    ]
                    name             = "sentinel-container"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ cpu                      = "512" -> "256" # forces replacement
      ~ id                       = "sentinel-task" -> (known after apply)
      ~ memory                   = "1024" -> "512" # forces replacement
      ~ revision                 = 25 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)

      - volume { # forces replacement
          - name = "sentinel-efs" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-0118752d3a059d765" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 2049 -> null

              - authorization_config {
                  - access_point_id = "fsap-01569aadbf52f98b5" -> null
                  - iam             = "ENABLED" -> null
                }
            }
        }
    }

  # aws_efs_access_point.sentinel will be destroyed
  # (because aws_efs_access_point.sentinel is not in configuration)
  - resource "aws_efs_access_point" "sentinel" {
      - arn             = "arn:aws:elasticfilesystem:eu-west-1:608859220822:access-point/fsap-01569aadbf52f98b5" -> null
      - file_system_arn = "arn:aws:elasticfilesystem:eu-west-1:608859220822:file-system/fs-0118752d3a059d765" -> null
      - file_system_id  = "fs-0118752d3a059d765" -> null
      - id              = "fsap-01569aadbf52f98b5" -> null
      - owner_id        = "608859220822" -> null
      - tags            = {} -> null
      - tags_all        = {} -> null

      - posix_user {
          - gid            = 1000 -> null
          - secondary_gids = [] -> null
          - uid            = 1000 -> null
        }

      - root_directory {
          - path = "/data" -> null

          - creation_info {
              - owner_gid   = 1000 -> null
              - owner_uid   = 1000 -> null
              - permissions = "777" -> null
            }
        }
    }

  # aws_efs_file_system.sentinel_efs will be destroyed
  # (because aws_efs_file_system.sentinel_efs is not in configuration)
  - resource "aws_efs_file_system" "sentinel_efs" {
      - arn                             = "arn:aws:elasticfilesystem:eu-west-1:608859220822:file-system/fs-0118752d3a059d765" -> null
      - creation_token                  = "sentinel-efs" -> null
      - dns_name                        = "fs-0118752d3a059d765.efs.eu-west-1.amazonaws.com" -> null
      - encrypted                       = false -> null
      - id                              = "fs-0118752d3a059d765" -> null
      - number_of_mount_targets         = 3 -> null
      - owner_id                        = "608859220822" -> null
      - performance_mode                = "generalPurpose" -> null
      - provisioned_throughput_in_mibps = 0 -> null
      - size_in_bytes                   = [
          - {
              - value             = 242890752
              - value_in_ia       = 0
              - value_in_standard = 242890752
            },
        ] -> null
      - tags                            = {} -> null
      - tags_all                        = {} -> null
      - throughput_mode                 = "bursting" -> null
    }

  # aws_efs_file_system_policy.policy will be destroyed
  # (because aws_efs_file_system_policy.policy is not in configuration)
  - resource "aws_efs_file_system_policy" "policy" {
      - bypass_policy_lockout_safety_check = false -> null
      - file_system_id                     = "fs-0118752d3a059d765" -> null
      - id                                 = "fs-0118752d3a059d765" -> null
      - policy                             = jsonencode(
            {
              - Id        = "ExamplePolicy01"
              - Statement = [
                  - {
                      - Action    = [
                          - "elasticfilesystem:ClientMount",
                          - "elasticfilesystem:ClientWrite",
                        ]
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "true"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:elasticfilesystem:eu-west-1:608859220822:file-system/fs-0118752d3a059d765"
                      - Sid       = "ExampleSatement01"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_efs_mount_target.sentinel_efs_mount_target will be destroyed
  # (because aws_efs_mount_target.sentinel_efs_mount_target is not in configuration)
  - resource "aws_efs_mount_target" "sentinel_efs_mount_target" {
      - availability_zone_id   = "euw1-az3" -> null
      - availability_zone_name = "eu-west-1a" -> null
      - dns_name               = "fs-0118752d3a059d765.efs.eu-west-1.amazonaws.com" -> null
      - file_system_arn        = "arn:aws:elasticfilesystem:eu-west-1:608859220822:file-system/fs-0118752d3a059d765" -> null
      - file_system_id         = "fs-0118752d3a059d765" -> null
      - id                     = "fsmt-01667c64f7eee1f28" -> null
      - ip_address             = "10.0.101.127" -> null
      - mount_target_dns_name  = "eu-west-1a.fs-0118752d3a059d765.efs.eu-west-1.amazonaws.com" -> null
      - network_interface_id   = "eni-00e907d33b3bc0bce" -> null
      - owner_id               = "608859220822" -> null
      - security_groups        = [
          - "sg-041bcacab9ca36211",
        ] -> null
      - subnet_id              = "subnet-090dfd45beffb7486" -> null
    }

  # aws_efs_mount_target.sentinel_efs_mount_target_1 will be destroyed
  # (because aws_efs_mount_target.sentinel_efs_mount_target_1 is not in configuration)
  - resource "aws_efs_mount_target" "sentinel_efs_mount_target_1" {
      - availability_zone_id   = "euw1-az1" -> null
      - availability_zone_name = "eu-west-1b" -> null
      - dns_name               = "fs-0118752d3a059d765.efs.eu-west-1.amazonaws.com" -> null
      - file_system_arn        = "arn:aws:elasticfilesystem:eu-west-1:608859220822:file-system/fs-0118752d3a059d765" -> null
      - file_system_id         = "fs-0118752d3a059d765" -> null
      - id                     = "fsmt-0bbda75e78b6c95d2" -> null
      - ip_address             = "10.0.102.164" -> null
      - mount_target_dns_name  = "eu-west-1b.fs-0118752d3a059d765.efs.eu-west-1.amazonaws.com" -> null
      - network_interface_id   = "eni-02a07172ecef3b257" -> null
      - owner_id               = "608859220822" -> null
      - security_groups        = [
          - "sg-041bcacab9ca36211",
        ] -> null
      - subnet_id              = "subnet-0a7a98cb2bacb9e90" -> null
    }

  # aws_efs_mount_target.sentinel_efs_mount_target_2 will be destroyed
  # (because aws_efs_mount_target.sentinel_efs_mount_target_2 is not in configuration)
  - resource "aws_efs_mount_target" "sentinel_efs_mount_target_2" {
      - availability_zone_id   = "euw1-az2" -> null
      - availability_zone_name = "eu-west-1c" -> null
      - dns_name               = "fs-0118752d3a059d765.efs.eu-west-1.amazonaws.com" -> null
      - file_system_arn        = "arn:aws:elasticfilesystem:eu-west-1:608859220822:file-system/fs-0118752d3a059d765" -> null
      - file_system_id         = "fs-0118752d3a059d765" -> null
      - id                     = "fsmt-05a6ec06ad6bf312e" -> null
      - ip_address             = "10.0.103.33" -> null
      - mount_target_dns_name  = "eu-west-1c.fs-0118752d3a059d765.efs.eu-west-1.amazonaws.com" -> null
      - network_interface_id   = "eni-06b38118e39e91a10" -> null
      - owner_id               = "608859220822" -> null
      - security_groups        = [
          - "sg-041bcacab9ca36211",
        ] -> null
      - subnet_id              = "subnet-070d485b41be586ea" -> null
    }

  # aws_iam_policy.sentinel_task_execution_policy will be destroyed
  # (because aws_iam_policy.sentinel_task_execution_policy is not in configuration)
  - resource "aws_iam_policy" "sentinel_task_execution_policy" {
      - arn       = "arn:aws:iam::608859220822:policy/sentinel-task-execution-policy" -> null
      - id        = "arn:aws:iam::608859220822:policy/sentinel-task-execution-policy" -> null
      - name      = "sentinel-task-execution-policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "elasticfilesystem:ClientMount",
                          - "elasticfilesystem:ClientWrite",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAY3QWWNNLPDZ4ESXYT" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # aws_iam_role_policy_attachment.sentinel_task_execution_policy_attachment_efs will be destroyed
  # (because aws_iam_role_policy_attachment.sentinel_task_execution_policy_attachment_efs is not in configuration)
  - resource "aws_iam_role_policy_attachment" "sentinel_task_execution_policy_attachment_efs" {
      - id         = "sentinel-task-execution-role-20230528163857679700000001" -> null
      - policy_arn = "arn:aws:iam::608859220822:policy/sentinel-task-execution-policy" -> null
      - role       = "sentinel-task-execution-role" -> null
    }

  # aws_security_group.sentinel_efs_sg will be destroyed
  # (because aws_security_group.sentinel_efs_sg is not in configuration)
  - resource "aws_security_group" "sentinel_efs_sg" {
      - arn                    = "arn:aws:ec2:eu-west-1:608859220822:security-group/sg-041bcacab9ca36211" -> null
      - description            = "Security group for Sentinel EFS" -> null
      - egress                 = [] -> null
      - id                     = "sg-041bcacab9ca36211" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 2049
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-081812c273c8df33d",
                ]
              - self             = false
              - to_port          = 2049
            },
        ] -> null
      - name                   = "sentinel-efs-sg" -> null
      - owner_id               = "608859220822" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-056d05666a5998eab" -> null
    }

  # aws_security_group_rule.sentinel_efs_sg_ingress will be destroyed
  # (because aws_security_group_rule.sentinel_efs_sg_ingress is not in configuration)
  - resource "aws_security_group_rule" "sentinel_efs_sg_ingress" {
      - from_port                = 2049 -> null
      - id                       = "sgrule-3807500489" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-041bcacab9ca36211" -> null
      - security_group_rule_id   = "sgr-0a5cebd56e60df190" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-081812c273c8df33d" -> null
      - to_port                  = 2049 -> null
      - type                     = "ingress" -> null
    }

Plan: 1 to add, 1 to change, 11 to destroy.
```
</details>